dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
#include "sync_mode.h"

#include "zbox_config.h"
#include "logging.h"
#include "state.h"
#include "leds.h"
#include "battery.h"
#include "diagnostics.h"
#include "audio.h"
#include "nfc_module.h"
#include "sleep.h"

#include <Arduino.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <SD.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <WebServer.h>
#include <esp_bt.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>
#include <stdarg.h>
#include <string.h>

static WebServer httpServer(SYNC_HTTP_PORT);
static File uploadFile;
static String uploadTempPath;
static String uploadFinalPath;
static String uploadError;
static uint32_t uploadSourceMtime = 0;
static bool uploadInProgress = false;
static size_t uploadBytesWritten = 0;
static unsigned long uploadStartedAtMs = 0;
static String syncHostname;
static String syncDeviceId;

static const char *SYNC_META_PATH = "/data/sync_meta.json";
static const char *SYNC_LOG_NAMES[] = {"debug.log", "debug.log.old"};
static const size_t SYNC_LOG_COUNT = sizeof(SYNC_LOG_NAMES) / sizeof(SYNC_LOG_NAMES[0]);

static void syncLogf(const char *fmt, ...)
{
    char line[224];
    va_list args;
    va_start(args, fmt);
    vsnprintf(line, sizeof(line), fmt, args);
    va_end(args);

    Serial.println(line);
}

static String buildDeviceId()
{
    uint64_t mac = ESP.getEfuseMac();
    char buf[17];
    snprintf(buf, sizeof(buf), "%04X%08lX",
             (uint16_t)(mac >> 32), (unsigned long)(mac & 0xFFFFFFFFULL));
    return String(buf);
}

static void clearSyncFlag()
{
    if (SD.exists(SYNC_PENDING_PATH))
        SD.remove(SYNC_PENDING_PATH);
}

static void disableBtForSync()
{
    esp_bt_controller_disable();
    esp_bt_controller_deinit();
    esp_bt_mem_release(ESP_BT_MODE_BTDM);
}

static void configureSyncWatchdog()
{
#if ESP_IDF_VERSION_MAJOR >= 5
    esp_task_wdt_config_t wdt_cfg = {
        .timeout_ms = 15000,
        .idle_core_mask = 0,
        .trigger_panic = false
    };
    esp_task_wdt_reconfigure(&wdt_cfg);
#else
    esp_task_wdt_init(15, false);
#endif
    esp_task_wdt_add(NULL);
}

static void disableSyncWatchdog()
{
    esp_task_wdt_delete(NULL);
}

static bool isPathSafe(const String &path)
{
    return path.startsWith("/") && path.indexOf("..") < 0 &&
           path.indexOf('\\') < 0 && path.indexOf("//") < 0;
}

static bool isManagedPath(const String &path)
{
    if (!isPathSafe(path))
        return false;
    return path == "/data/mappings.json" ||
           path == "/data/system_sounds.json" ||
           path == "/data/led_config.json" ||
           path.startsWith("/music/") ||
           path.startsWith("/data/system/");
}

static bool isUploadPath(const String &path)
{
    if (!isManagedPath(path))
        return false;
    return path.startsWith("/music/") || path.startsWith("/data/system/");
}

static bool isSyncLogName(const String &name)
{
    for (size_t i = 0; i < SYNC_LOG_COUNT; i++)
    {
        if (name == SYNC_LOG_NAMES[i])
            return true;
    }
    return false;
}

static String syncLogPath(const String &name)
{
    if (!isSyncLogName(name))
        return String();
    return "/data/" + name;
}

static void ensureDataDirs()
{
    if (!SD.exists("/music"))
        SD.mkdir("/music");
    if (!SD.exists("/data"))
        SD.mkdir("/data");
    if (!SD.exists("/data/system"))
        SD.mkdir("/data/system");
}

static void loadSyncMeta(JsonDocument &doc)
{
    doc.clear();
    File f = SD.open(SYNC_META_PATH, FILE_READ);
    if (!f)
        return;
    deserializeJson(doc, f);
    f.close();
    if (!doc.is<JsonObject>())
        doc.to<JsonObject>();
}

static void saveSyncMeta(JsonDocument &doc)
{
    if (SD.exists(SYNC_META_PATH))
        SD.remove(SYNC_META_PATH);
    File f = SD.open(SYNC_META_PATH, FILE_WRITE);
    if (!f)
        return;
    serializeJson(doc, f);
    f.close();
}

static uint64_t getTrackedMtime(const String &path, File &file)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    if (root[path].is<uint64_t>())
        return root[path].as<uint64_t>();
    return (uint64_t)file.getLastWrite();
}

static void setTrackedMtime(const String &path, uint32_t mtime)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    root[path] = mtime;
    saveSyncMeta(doc);
}

static void removeTrackedMtime(const String &path)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    root.remove(path);
    saveSyncMeta(doc);
}

static void sendSyncSnapshot()
{
    BatteryReading bat = readBatteryReading();
    esp_reset_reason_t reason = esp_reset_reason();
    syncLogf("[SYNC] uptime_ms=%lu reset=%d(%s) ip=%s rssi=%d",
             millis(), (int)reason, resetReasonName(reason),
             WiFi.localIP().toString().c_str(), WiFi.RSSI());
    syncLogf("[SYNC] battery adc_pin_v=%.3f battery_v=%.3f bars=%d color=%s charging_known=false",
             bat.adcPinVoltage, bat.batteryVoltage, bat.bars, bat.color);
    syncLogf("[SYNC] heap free=%u min=%u largest=%u sketch_free=%u",
             ESP.getFreeHeap(), ESP.getMinFreeHeap(), ESP.getMaxAllocHeap(), ESP.getFreeSketchSpace());
    syncLogf("[SYNC] hwm loop=%u led=%u audio=%u nfc=%u",
             uxTaskGetStackHighWaterMark(NULL), ledGetTaskHWM(), audioGetTaskHWM(), nfcGetTaskHWM());
}

static bool handleButtonExit()
{
    static bool armed = false;
    static unsigned long holdStart = 0;

    bool bothDown = digitalRead(BTN_A) == LOW && digitalRead(BTN_B) == LOW;
    if (!armed)
    {
        if (!bothDown)
            armed = true;
        return false;
    }

    if (!bothDown)
    {
        holdStart = 0;
        return false;
    }

    if (holdStart == 0)
        holdStart = millis();
    return millis() - holdStart >= LONG_PRESS_MS;
}

enum SyncSleepAction
{
    SYNC_SLEEP_NONE = 0,
    SYNC_SLEEP_NORMAL,
    SYNC_SLEEP_EMERGENCY
};

static SyncSleepAction handleSleepButton()
{
    static bool btnCHeld = false;
    static bool sleepArmed = false;
    static unsigned long holdStart = 0;

    bool cDown = digitalRead(BTN_C) == LOW;
    bool dDown = digitalRead(BTN_D) == LOW;

    if (dDown)
    {
        btnCHeld = false;
        sleepArmed = false;
        holdStart = 0;
        return SYNC_SLEEP_NONE;
    }

    if (cDown)
    {
        if (!btnCHeld)
        {
            btnCHeld = true;
            sleepArmed = false;
            holdStart = millis();
        }

        unsigned long heldMs = millis() - holdStart;
        if (heldMs >= EMERGENCY_SLEEP_MS)
        {
            btnCHeld = false;
            sleepArmed = false;
            holdStart = 0;
            syncLogf("[SYNC] emergency sleep requested by long BTN_C");
            return SYNC_SLEEP_EMERGENCY;
        }

        if (!sleepArmed && heldMs >= LONG_PRESS_MS)
        {
            sleepArmed = true;
            syncLogf("[SYNC] sleep armed - release BTN_C for deep sleep");
        }

