dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
        return SYNC_SLEEP_NONE;
    }

    if (btnCHeld)
    {
        bool triggerSleep = sleepArmed && (millis() - holdStart >= LONG_PRESS_MS);
        btnCHeld = false;
        sleepArmed = false;
        holdStart = 0;
        return triggerSleep ? SYNC_SLEEP_NORMAL : SYNC_SLEEP_NONE;
    }

    return SYNC_SLEEP_NONE;
}

static void exitSyncMode(const char *reason)
{
    syncLogf("[SYNC] exit requested: %s", reason);
    ledFlashResult(true);
    clearSyncFlag();
    delay(500);
    ESP.restart();
}

static void sendJson(int code, JsonDocument &doc)
{
    String body;
    serializeJson(doc, body);
    httpServer.send(code, "application/json", body);
}

static void sendError(int code, const char *message)
{
    JsonDocument doc;
    doc["error"] = message;
    sendJson(code, doc);
}

static bool rejectWhileUploadBusy(const char *routeName)
{
    if (!uploadInProgress)
        return false;

    syncLogf("[SYNC] busy upload blocking route=%s target=%s bytes=%u",
             routeName,
             uploadFinalPath.c_str(),
             (unsigned int)uploadBytesWritten);
    sendError(503, "upload in progress");
    return true;
}

static bool requireSdReady()
{
    if (sdReady)
        return true;
    sendError(503, "sd not ready");
    return false;
}

static void appendFileInfo(JsonArray files, const String &path, File &file)
{
    JsonObject obj = files.add<JsonObject>();
    obj["path"] = path;
    obj["size"] = (uint64_t)file.size();
    obj["mtime"] = getTrackedMtime(path, file);
}

static void appendDirectoryFiles(JsonArray files, const char *dirPath)
{
    File dir = SD.open(dirPath);
    if (!dir || !dir.isDirectory())
        return;

    while (true)
    {
        File entry = dir.openNextFile();
        if (!entry)
            break;
        if (!entry.isDirectory())
        {
            String path = entry.name();
            if (!path.startsWith("/"))
                path = String(dirPath) + "/" + path;
            appendFileInfo(files, path, entry);
        }
        entry.close();
    }
    dir.close();
}

static void populateStatus(JsonDocument &doc)
{
    BatteryReading bat = readBatteryReading();
    doc["device_id"] = syncDeviceId;
    doc["hostname"] = syncHostname;
    doc["mode"] = "sync";
    doc["ip"] = WiFi.localIP().toString();
    doc["rssi"] = WiFi.RSSI();
    doc["sd_ok"] = sdReady;
    doc["battery_v"] = bat.batteryVoltage;
    doc["battery_bars"] = bat.bars;
    if (sdReady)
    {
        doc["sd_total"] = (uint64_t)SD.totalBytes();
        doc["sd_used"] = (uint64_t)SD.usedBytes();
    }
}

static void handleStatus()
{
    if (rejectWhileUploadBusy("status"))
        return;
    JsonDocument doc;
    populateStatus(doc);
    doc["upload_in_progress"] = uploadInProgress;
    if (uploadInProgress)
    {
        doc["upload_path"] = uploadFinalPath;
        doc["upload_bytes_written"] = (uint64_t)uploadBytesWritten;
        doc["upload_elapsed_ms"] = millis() - uploadStartedAtMs;
    }
    sendJson(200, doc);
}

static void handleFiles()
{
    if (rejectWhileUploadBusy("files"))
        return;
    if (!requireSdReady())
        return;

    JsonDocument doc;
    populateStatus(doc);
    JsonArray files = doc["files"].to<JsonArray>();
    appendDirectoryFiles(files, "/music");
    appendDirectoryFiles(files, "/data/system");

    const char *singles[] = {
        "/data/mappings.json",
        "/data/system_sounds.json",
        "/data/led_config.json",
    };
    for (const char *path : singles)
    {
        File f = SD.open(path, FILE_READ);
        if (f && !f.isDirectory())
            appendFileInfo(files, path, f);
        if (f)
            f.close();
    }
    sendJson(200, doc);
}

static bool writeJsonFile(const char *path, const String &body)
{
    JsonDocument doc;
    if (deserializeJson(doc, body) != DeserializationError::Ok)
        return false;

    String tempPath = String(path) + ".tmp";
    if (SD.exists(tempPath))
        SD.remove(tempPath);

    File f = SD.open(tempPath, FILE_WRITE);
    if (!f)
        return false;
    size_t written = serializeJson(doc, f);
    f.close();
    if (written == 0)
    {
        SD.remove(tempPath);
        return false;
    }

    if (SD.exists(path))
        SD.remove(path);
    if (!SD.rename(tempPath, path))
    {
        SD.remove(tempPath);
        return false;
    }
    return true;
}

static void handleWriteMappings()
{
    if (rejectWhileUploadBusy("write-mappings"))
        return;
    if (!requireSdReady())
        return;

    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }
    if (!writeJsonFile("/data/mappings.json", body))
    {
        sendError(400, "invalid mappings json");
        return;
    }
    JsonDocument doc;
    doc["saved"] = "/data/mappings.json";
    sendJson(200, doc);
}

static void handleWriteSystemSounds()
{
    if (rejectWhileUploadBusy("write-system-sounds"))
        return;
    if (!requireSdReady())
        return;

    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }
    if (!writeJsonFile("/data/system_sounds.json", body))
    {
        sendError(400, "invalid system_sounds json");
        return;
    }
    JsonDocument doc;
    doc["saved"] = "/data/system_sounds.json";
    sendJson(200, doc);
}

static void handleGetLedConfig()
{
    if (rejectWhileUploadBusy("get-config"))
        return;
    if (!requireSdReady())
        return;
    httpServer.send(200, "application/json", ledGetConfigJson());
}

static void handleSaveLedConfig()
{
    if (rejectWhileUploadBusy("save-config"))
        return;
    if (!requireSdReady())
        return;

    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }
    if (!ledSaveConfigJson(body))
    {
        sendError(400, "invalid led config");
        return;
    }
    JsonDocument doc;
    doc["saved"] = "/data/led_config.json";
    sendJson(200, doc);
}

static void handleDeleteFile()
{
    if (rejectWhileUploadBusy("delete-file"))
        return;
    if (!requireSdReady())
        return;

