dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
    String path = httpServer.arg("path");
    if (!isManagedPath(path))
    {
        sendError(400, "invalid path");
        return;
    }
    if (SD.exists(path) && !SD.remove(path))
    {
        sendError(500, "delete failed");
        return;
    }
    removeTrackedMtime(path);

    JsonDocument doc;
    doc["deleted"] = path;
    sendJson(200, doc);
}

static void handleRestart()
{
    if (rejectWhileUploadBusy("restart"))
        return;
    JsonDocument doc;
    doc["restart"] = true;
    sendJson(200, doc);
    delay(200);
    exitSyncMode("http restart");
}

static void appendSyncLogInfo(JsonArray logs, const char *name)
{
    String path = syncLogPath(name);
    if (!path.length())
        return;

    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        return;
    }

    JsonObject obj = logs.add<JsonObject>();
    obj["name"] = name;
    obj["size"] = (uint64_t)f.size();
    obj["mtime"] = (uint64_t)f.getLastWrite();
    f.close();
}

static void handleLogs()
{
    if (rejectWhileUploadBusy("logs"))
        return;
    if (!requireSdReady())
        return;

    JsonDocument doc;
    JsonArray logs = doc["logs"].to<JsonArray>();
    for (size_t i = 0; i < SYNC_LOG_COUNT; i++)
        appendSyncLogInfo(logs, SYNC_LOG_NAMES[i]);
    sendJson(200, doc);
}

static void handleLogContent()
{
    if (rejectWhileUploadBusy("log-content"))
        return;
    if (!requireSdReady())
        return;

    String name = httpServer.arg("name");
    if (!isSyncLogName(name))
    {
        sendError(400, "invalid log name");
        return;
    }

    int tail = httpServer.arg("tail").toInt();
    if (tail <= 0)
        tail = 200;
    if (tail > 500)
        tail = 500;

    String path = syncLogPath(name);
    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        sendError(404, "log not found");
        return;
    }

    String *ring = new String[tail];
    int totalLines = 0;
    while (f.available())
    {
        String line = f.readStringUntil('\n');
        while (line.endsWith("\n") || line.endsWith("\r"))
            line.remove(line.length() - 1);
        ring[totalLines % tail] = line;
        totalLines++;
    }
    f.close();

    int count = totalLines < tail ? totalLines : tail;
    int start = totalLines > tail ? (totalLines % tail) : 0;
    String text;
    for (int i = 0; i < count; i++)
    {
        const String &line = ring[(start + i) % tail];
        text += line;
        text += '\n';
    }
    delete[] ring;

    JsonDocument doc;
    doc["name"] = name;
    doc["text"] = text;
    doc["truncated"] = totalLines > tail;
    sendJson(200, doc);
}

static void handleLogDownload()
{
    if (rejectWhileUploadBusy("log-download"))
        return;
    if (!requireSdReady())
        return;

    String name = httpServer.arg("name");
    if (!isSyncLogName(name))
    {
        sendError(400, "invalid log name");
        return;
    }

    String path = syncLogPath(name);
    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        sendError(404, "log not found");
        return;
    }

    httpServer.sendHeader("Content-Disposition", "attachment; filename=\"" + name + "\"");
    httpServer.streamFile(f, "text/plain; charset=utf-8");
    f.close();
}

static void handleUploadResult()
{
    if (!uploadError.isEmpty())
    {
        syncLogf("[SYNC] upload result error target=%s error=%s", uploadFinalPath.c_str(), uploadError.c_str());
        sendError(400, uploadError.c_str());
        uploadError = "";
        uploadInProgress = false;
        return;
    }

    syncLogf("[SYNC] upload result ok target=%s bytes=%u elapsed_ms=%lu",
             uploadFinalPath.c_str(),
             (unsigned int)uploadBytesWritten,
             millis() - uploadStartedAtMs);
    JsonDocument doc;
    doc["uploaded"] = uploadFinalPath;
    sendJson(200, doc);
    uploadInProgress = false;
}

static void handleUploadStream()
{
    HTTPUpload &upload = httpServer.upload();

    if (upload.status == UPLOAD_FILE_START)
    {
        esp_task_wdt_reset();
        uploadInProgress = true;
        uploadError = "";
        uploadTempPath = "";
        uploadFinalPath = "";
        uploadSourceMtime = 0;
        uploadBytesWritten = 0;
        uploadStartedAtMs = millis();
        uploadFile = File();

        if (!sdReady)
        {
            uploadError = "sd not ready";
            return;
        }

        uploadFinalPath = httpServer.arg("path");
        if (!isUploadPath(uploadFinalPath))
        {
            uploadError = "invalid upload path";
            return;
        }
        uploadSourceMtime = (uint32_t)httpServer.arg("mtime").toInt();
        syncLogf("[SYNC] upload start target=%s mtime=%u", uploadFinalPath.c_str(), (unsigned int)uploadSourceMtime);

        uploadTempPath = uploadFinalPath + ".tmp";
        if (SD.exists(uploadTempPath))
            SD.remove(uploadTempPath);
        uploadFile = SD.open(uploadTempPath, FILE_WRITE);
        if (!uploadFile)
            uploadError = "cannot open temp file";
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (uploadError.isEmpty() && uploadFile)
        {
            esp_task_wdt_reset();
            if (uploadFile.write(upload.buf, upload.currentSize) != upload.currentSize)
                uploadError = "write failed";
            else
                uploadBytesWritten += upload.currentSize;
        }
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        esp_task_wdt_reset();
        if (uploadFile)
            uploadFile.close();
        if (uploadError.isEmpty())
        {
            if (SD.exists(uploadFinalPath))
                SD.remove(uploadFinalPath);
            if (!SD.rename(uploadTempPath, uploadFinalPath))
            {
                SD.remove(uploadTempPath);
                uploadError = "rename failed";
            }
            else if (uploadSourceMtime > 0)
            {
                setTrackedMtime(uploadFinalPath, uploadSourceMtime);
            }
            syncLogf("[SYNC] upload end target=%s bytes=%u elapsed_ms=%lu",
                     uploadFinalPath.c_str(),
                     (unsigned int)uploadBytesWritten,
                     millis() - uploadStartedAtMs);
        }
        else if (uploadTempPath.length())
        {
            SD.remove(uploadTempPath);
            syncLogf("[SYNC] upload failed target=%s error=%s bytes=%u",
                     uploadFinalPath.c_str(),
                     uploadError.c_str(),
                     (unsigned int)uploadBytesWritten);
        }
        uploadFile = File();
        uploadInProgress = false;
    }
    else if (upload.status == UPLOAD_FILE_ABORTED)
    {
        esp_task_wdt_reset();
        if (uploadFile)
            uploadFile.close();
        if (uploadTempPath.length())
            SD.remove(uploadTempPath);
        uploadError = "upload aborted";
        syncLogf("[SYNC] upload aborted target=%s bytes=%u elapsed_ms=%lu",
                 uploadFinalPath.c_str(),
                 (unsigned int)uploadBytesWritten,
                 millis() - uploadStartedAtMs);
        uploadFile = File();
        uploadInProgress = false;
    }
}

static void handleNotFound()
{
    sendError(404, "not found");
}

static void setupHttpRoutes()
{
    httpServer.on("/diag/status", HTTP_GET, handleStatus);
    httpServer.on("/diag/files", HTTP_GET, handleFiles);
    httpServer.on("/diag/upload", HTTP_POST, handleUploadResult, handleUploadStream);
    httpServer.on("/diag/file", HTTP_DELETE, handleDeleteFile);
    httpServer.on("/diag/logs", HTTP_GET, handleLogs);
    httpServer.on("/diag/log-content", HTTP_GET, handleLogContent);
    httpServer.on("/diag/log-download", HTTP_GET, handleLogDownload);
    httpServer.on("/diag/write-mappings", HTTP_POST, handleWriteMappings);
    httpServer.on("/diag/write-system-sounds", HTTP_POST, handleWriteSystemSounds);
    httpServer.on("/diag/config", HTTP_GET, handleGetLedConfig);
    httpServer.on("/diag/config", HTTP_POST, handleSaveLedConfig);
    httpServer.on("/diag/restart", HTTP_POST, handleRestart);
    httpServer.onNotFound(handleNotFound);
    httpServer.begin();
}

