dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
static void setupOta()
{
    ArduinoOTA.setHostname(syncHostname.c_str());
    ArduinoOTA.setPort(SYNC_OTA_PORT);
    ArduinoOTA.onStart([]() {
        syncLogf("[OTA] start");
        ledSetSyncWifi();
    });
    ArduinoOTA.onEnd([]() {
        syncLogf("[OTA] complete");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        esp_task_wdt_reset();
        static unsigned int lastPct = 0;
        unsigned int pct = total ? (progress * 100U) / total : 0;
        if (pct >= lastPct + 10 || pct == 100)
        {
            lastPct = pct;
            syncLogf("[OTA] %u%%", pct);
        }
    });
    ArduinoOTA.onError([](ota_error_t error) {
        syncLogf("[OTA] error=%u", (unsigned int)error);
    });
    ArduinoOTA.begin();
}

void runSyncMode()
{
    LOGLN("\n=== zBox SYNC MODE ===\n");
    ledSetSyncWifi();
    disableBtForSync();
    ensureDataDirs();

    syncDeviceId = buildDeviceId();
    syncHostname = String("zbox-") + syncDeviceId.substring(max(0, (int)syncDeviceId.length() - 6));

    WiFiManager wm;
    wm.setConfigPortalTimeout(180);
    wm.setConnectTimeout(10);
    wm.setAPCallback([](WiFiManager *mgr) {
        (void)mgr;
        syncLogf("[SYNC] WiFi connect failed - starting config portal SSID=%s ip=%s",
                 SYNC_AP_NAME, WiFi.softAPIP().toString().c_str());
    });

    disableSyncWatchdog();
    syncLogf("[SYNC] Connecting to stored WiFi or starting config portal");

    if (!wm.autoConnect(SYNC_AP_NAME))
    {
        syncLogf("[SYNC] Config portal timed out - returning to normal mode");
        LOGLN("[SYNC] WiFi not connected");
        ledFlashResult(false);
        clearSyncFlag();
        delay(1000);
        ESP.restart();
    }

    configureSyncWatchdog();
    syncLogf("[SYNC] WiFi connected ssid=%s ip=%s",
             WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());

    setupHttpRoutes();
    setupOta();

    LOG("[SYNC] device=%s ip=%s ota=%d http=%d\n",
        syncDeviceId.c_str(), WiFi.localIP().toString().c_str(),
        SYNC_OTA_PORT, SYNC_HTTP_PORT);

    unsigned long lastSnapshot = 0;
    for (;;)
    {
        esp_task_wdt_reset();
        ArduinoOTA.handle();
        httpServer.handleClient();

        if (handleButtonExit())
            exitSyncMode("buttons A+B long");

        SyncSleepAction sleepAction = handleSleepButton();
        if (sleepAction == SYNC_SLEEP_NORMAL)
        {
            syncLogf("[SYNC] deep sleep requested by BTN_C");
            enterDeepSleep();
        }
        else if (sleepAction == SYNC_SLEEP_EMERGENCY)
        {
            enterEmergencyDeepSleep();
        }

        unsigned long now = millis();
        if (now - lastSnapshot >= SYNC_LOG_INTERVAL_MS)
        {
            sendSyncSnapshot();
            lastSnapshot = now;
        }

        delay(20);
    }
}
